import { MigrationInterface, QueryRunner } from 'typeorm';

export class InsertRoutes1745784562351 implements MigrationInterface {
  public async up(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(
      `
INSERT INTO Routes (name, starting_point, ending_point, stops, distance, price) VALUES
('Минск - Гродно', 'Минск', 'Гродно', 'Лида, Щучин', 280.00, 15.00),
('Минск - Брест', 'Минск', 'Брест', 'Барановичи, Кобрин', 340.00, 18.00),
('Витебск - Гомель', 'Витебск', 'Гомель', 'Орша, Могилёв', 320.00, 16.50),
('Гродно - Брест', 'Гродно', 'Брест', 'Волковыск, Пружаны', 230.00, 12.00),
('Минск - Витебск', 'Минск', 'Витебск', 'Борисов, Орша', 250.00, 13.50),
('Минск - Могилёв', 'Минск', 'Могилёв', 'Борисов, Березино', 200.00, 10.50),
('Брест - Пинск', 'Брест', 'Пинск', 'Ивацевичи, Дрогичин', 140.00, 8.00),
('Гомель - Бобруйск', 'Гомель', 'Бобруйск', 'Речица, Жлобин', 130.00, 7.50),
('Витебск - Новополоцк', 'Витебск', 'Новополоцк', 'Полоцк', 100.00, 6.00),
('Минск - Лида', 'Минск', 'Лида', 'Столбцы, Новогрудок', 150.00, 9.00),
('Гродно - Витебск', 'Гродно', 'Витебск', 'Минск, Орша', 400.00, 20.00),
('Могилёв - Брест', 'Могилёв', 'Брест', 'Бобруйск, Барановичи', 420.00, 22.00),
('Минск - Пинск', 'Минск', 'Пинск', 'Слуцк, Лунинец', 260.00, 14.00),
('Гомель - Мозырь', 'Гомель', 'Мозырь', 'Калинковичи', 90.00, 5.50),
('Брест - Гомель', 'Брест', 'Гомель', 'Пинск, Жлобин', 450.00, 23.50),
('Минск - Гомель', 'Минск', 'Гомель', 'Толочин, Орша', 290.00, 15.50),
('Минск - Молодечно', 'Минск', 'Молодечно', 'Смолевичи', 110.00, 7.00),
('Гродно - Минск', 'Гродно', 'Минск', 'Воложин', 100.00, 6.50),
('Брест - Минск', 'Брест', 'Минск', 'Ручно', 340.00, 18.00),
('Гомель - Витебск', 'Гомель', 'Витебск', 'Чечерск', 280.00, 14.00),
('Пинск - Гомель', 'Пинск', 'Гомель', 'Лунинец', 250.00, 13.00),
('Могилёв - Минск', 'Могилёв', 'Минск', 'Березино', 200.00, 10.50),
('Витебск - Минск', 'Витебск', 'Минск', 'Борисов', 250.00, 13.50),
('Бобруйск - Минск', 'Бобруйск', 'Минск', 'Осиповичи', 140.00, 8.50),
('Пинск - Минск', 'Пинск', 'Минск', 'Лунинец, Слуцк', 260.00, 14.00);
`,
    );
  }

  public async down(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(`
      SET CONSTRAINTS ALL DEFERRED;
      TRUNCATE TABLE Routes, Buses, Schedules, BusSchedules CASCADE;
      ALTER SEQUENCE busSchedules_id_seq RESTART WITH 1;
      ALTER SEQUENCE schedules_id_seq RESTART WITH 1;
      ALTER SEQUENCE routes_id_seq RESTART WITH 1;
      ALTER SEQUENCE buses_id_seq RESTART WITH 1;
      SET CONSTRAINTS ALL IMMEDIATE;
    `);
  }
}
